"use strict";
let x = {
    name: {
        firstName: "FirstName",
    },
    age: 10,
};
let y = {
    name: {
        firstName: "FirstName",
    },
    age: 10,
};
/*
Вам потрібно сворити тип UpperCaseKeys, який буде приводити всі ключи
до верхнього регістру.
*/
/*
Стоврити тип, що на основі єнаму генерує тип об'єкту, що як ключ має назву
ключа єнаму з додатковим префіксом 'get-' а як значення просто функцію
*/
/*
І саме цікаве. Створіть тип ObjectToPropertyDescriptor,
який перетворює звичайний обʼєкт на обʼєкт де кожне value є дескриптором.
Створити тип, що буде повертати тип параметру функції
(Якщо в параметрі вказано массив number[] то вірним типом буде number)
*/
